In [1]:
# https://tidyr.tidyverse.org/reference/extract.html

from datar.all import *

print(extract.__doc__)

Given a regular expression with capturing groups, extract() turns each
    group into a new column. If the groups don't match, or the input is NA,
    the output will be NA.

    See: https://tidyr.tidyverse.org/reference/extract.html

    Args:
        _data: The dataframe
        col: Column name or position.
        into: Names of new variables to create as character vector.
            Use None to omit the variable in the output.
        regex: a regular expression used to extract the desired values.
            There should be one group (defined by ()) for each element of into.
        remove: If TRUE, remove input column from output data frame.
        convert: The universal type for the extracted columns or a dict for
            individual ones

    Returns:
        Dataframe with extracted columns.

In [2]:
df = tibble(x = c(NA, "a-b", "a-d", "b-c", "d-e"))
df >> extract(f.x, "A")

     A
0  NaN
1    a
2    a
3    b
4    d

In [3]:
df >> extract(f.x, c("A", "B"), r"(\w+)-(\w+)")

     A    B
0  NaN  NaN
1    a    b
2    a    d
3    b    c
4    d    e

In [4]:
df >> extract(f.x, c("A", "B"), r"([a-d]+)-([a-d]+)")

     A    B
0  NaN  NaN
1    a    b
2    a    d
3    b    c
4  NaN  NaN